// ১. একটা অবজেক্ট ডিক্লেয়ার করো। সেই অবজেক্ট এর মিনিমাম পাঁচটা প্রপার্টি থাকবে। তারপর একটা প্রপার্টি এর মান হবে অন্য আরেকটা অবজেক্ট , আরেকটা প্রপার্টি এর মান হবে একটা array । একটা প্রপার্টি এর মান হবে একটা ফাংশন(মেথড) । এই মেথড কে কল করলে সে মেথড এর ভিতর থেকে অবজেক্ট এর যেকোন একটা প্রপার্টি রিটার্ন করবে। আর বাকি দুইটা তোমার ইচ্ছা মতো। 
const obj = {
    name: 'sayed',
    isMarried: false,
    age: 22,
    cashPati: function () {
        console.log(this.name);
    },
    bookList: ['peradoxical sajid 1', 'peradoxical sajid 2', 'Quran', 'love Kandi'],
    medicinePrice: {
        arnica: 200,
        pulsatila: 250,
        rodo: 150
    }
}
// ২. একটা টেম্পলেট স্ট্রিং দিয়ে একটা স্ট্রিং ভেরিয়েবল ডিক্লেয়ার করো। সেটার মধ্যে উপরের অবজেক্ট এর একটা তিনটা প্রপার্টি এর মান তোমার টেমপ্লেট স্ট্রিং এর মধ্যে বসাও। এর মধ্যে একটা প্রপার্টি সেট করবে--যেটা নেস্টেড অবজেক্ট আছে সেটার প্রপার্টি থেকে। আরেকটা প্রপার্টি হবে যে প্রপার্টি এর মান একটা array সেটার সেকেন্ড পজিশন এর উপাদান দিয়ে। আর বাকি একটা তোমার ইচ্ছা মতো বসাতে পারো। 

const templeteString = `my name is ${obj.name} . i love ${obj.bookList[2]}. i am married it's true or false : ${obj.isMarried} `;
console.log(templeteString);

// ৩.১. শূন্য প্যারামিটার ওয়ালা একটা অ্যারো ফাংশন লিখবে যেটা ৮৯ রিটার্ন করবে। 
const arrFun = () => {
    const number = 89;
    return number;
}
arrFun()
// ৩.২. এক প্যারামিটার ওয়ালা একটা অ্যারো ফাংশন ডিক্লেয়ার করবে। এই ফাংশনের কাজ হবে যে প্যারামিটার নিবে সেটাকে 17 দিয়ে ভাগ করে ভাগফল রিটার্ন করবে। 

const arrFun2 = number => {
    const result = number / 17;
    return result;
}
arrFun2(34);

// ৩.৩ দুই, প্যারামিটার ওয়ালা একটা অ্যারো ফাংশন লিখবে। এই ফাংশনের কাজ হবে যে দুইটা প্যারামিটার ইনপুট নিবে। সেই দুইটা প্যারামিটারকে যোগ করে যোগফলকে দুই দিয়ে ভাগ করে ভাগফল রিটার্ণ করে দাও। 
const arrFun3 = (num1, num2) => {
    const sum = num1 + num2;
    const result = sum / 2;
    return result;
}
arrFun3(20, 20);
// ৩.৪ একাধিক লাইন ওয়ালা অ্যারো ফাংশন লিখো। সেটাতে দুইটা প্যারামিটার নিবে। ওই arrow ফাংশনটা হবে অনেকগুলা লাইনের। সেখানে প্রত্যেকটা ইনপুট প্যারামিটার এর সাথে ৭ যোগ করবে তারপর যোগফল দুইটাকে আবার যোগ করবে। ক্যামনে করবে সেটা চিন্তা করে বের করার চেষ্টা করো।
// others from video 
const arrFun4 = (first, second) => {
    const firstSum = first + 7;
    const secondSum = second + 5;
    const totalSum = firstSum + secondSum;

    if (totalSum % 2 === 0) {
        return true;
    } else {
        return false;
    }
}



// ৪. অনেকগুলা সংখ্যার একটা array হবে। তারপর তোমার কাজ হবে array এর উপরে map ইউজ করে। প্রত্যেকটা উপাদানকে ৭ দিয়ে ভাগ করে ভাগফল আরেকটা array হিসেবে রাখবে। পুরা কাজটা এক লাইনে হবে। 
const numbers = [12, 23, 34, 45, 56, 67, 8, 7, 898, 9, 80];
const newArr = numbers.map(function (number) { return number / 7 });

/*
// ৫. জাভাস্ক্রিপ্ট এ array এর map, forEach, filter, find কোনটা দিয়ে কি হয়। সেটার একটা সামারি লিখে ফেলো। 


>>> map : কোন একটা array এর single উপদান গুলুর উপরে function ব্যাবহার করতে চাইলে map ব্যাবহার করতে হয় , এবং result কে অন্য একটা array এর  মধ্যে দেখা যায় ।

>>> forEach: কোন একটা array এর single উপদান গুলুর উপরে function ব্যাবহার করতে forEach ব্যাবহার করতে হয় কিন্তু result আলাদা আলাদা দেখাই , কোন array এর মধ্যে না ।

>>> filter: কোন একটা শর্ত ব্যাবহার করে array এর মধ্যে থেকে উপদান কে খুঁজে ব্যের করার জন্য filter ব্যাবহার করা হয় 

>>> find: কোন একটা শর্ত ব্যাবহার করে array এর মধ্যে থেকে শুধু ১ম উপদান কে খুঁজে ব্যের করার জন্য find ব্যাবহার করা হয় । 

*/

// ৬. সিম্পল একটা জাভাস্ক্রিপ্ট অবজেক্ট এর কোন একটা প্রোপার্টিকে ভেরিয়েবল হিসেবে ডিক্লেয়ার করার জন্য destructuring ইউজ করো। array এর destructuring করবে আর সেটা করার জন্য তুমি এরে এর সেকেন্ড পজিশন এর উপাদান কে destructuring করে 'balance' নামক একটা ভেরিয়েবল এ রাখবে।
let a;
let b;
let balance;
let rest;
[a, b, balance, ...rest] = [10, 20, 30, 40, 50, 12, 23, 34, 45, 56, 67, 89, 90,];
console.log(a, b);
console.log(balance);
console.log(rest);


// ৭. একদম প্রাথমিক স্টেপ হিসেবে jsonplaceholder এর ওয়েবসাইট থেকে ডাটা fetch করে সেটাকে কনসোল এ দেখাতে হবে। ধরো তুমি তাদের ওয়েবসাইট এ photos এর API এর লিংক কোনটা সেটা জাভাস্ক্রিপ্ট দিয়ে কোড করে সেই ডাটা কনসোল এ দেখতে পারতেছো কিনা। তারপর কয়েকটা কার্ড বানাবে (হতে পারে বুটস্ট্রাপ এর কার্ড) সেগুলা আবার তুমি html দিয়ে ওয়েবসাইট এ ছবি এবং ছবির নিচে ছবির টাইটেল দেখাবে। 
//parbo IngShaAllah

// ৮. প্রত্যেকটা ফটোতে ক্লিক করলে উপরে আরেকটা div থাকবে। ক্লিক করার পর ডাইনামিকভাবে ওই ফটো এর ডাটা লোড করবে। সেটা করার জন্য আগের ডাটা লোড করার API এর লিংক এর পরে photos এর পরে ডাইনামিকভাবে ${id} বসিয়ে দিবে। এরপর ডিটেইল অংশে photo এর url দিয়ে মেইন ইমেজ এবং thumbnail ইমেজ দুইটাই দেখাবে। সাথে সাথে title প্রপার্টিও দেখাবে।
//parbo IngShaAllah

// ৯. তুমি যে ডাটা লোড করেছো। বা ডাটা ওয়েবসাইট এ দেখাচ্ছ। সেই কোড এর মধ্যে arrow ফাংশন ইউজ করতে পারতেছো কিনা। যখন লুপ চালাচ্ছ সেখানে forEach ইউজ করতে পারতেছো কি
//parbo IngShaAllah